#+TITLE: Emacs config
#+AUTHOR: Yorick van Pelt

** config
#+BEGIN_SRC emacs-lisp
    (setq org-pretty-entities t)
    (setq org-startup-indented t)
    (setq org-src-fontify-natively t)
    (setq org-completion-use-ido t)
    (setq org-src-tab-acts-natively t)
    (setq org-ellipsis "⬎")
    (setq org-log-done t)
    (setq org-todo-keywords
        '((sequence "TODO(t)" "WAIT" "|" "DONE(d)" "CANCEL")))
  (setq org-agenda-files (list "~/org/life.org"
            "~/org/ru.org" 
            "~/org/symfo.org"
            "~/org/fiction.org"
            "~/serokell/serok.el/2019.org"
            "~/engineering/lumi.org"
            "~/serokell/serok.el/tasks.org"))
  (setq org-use-fast-todo-selection t)
  (setq org-directory "~/org")

  (defun org-file-path (filename)
  "Return the absolute address of an org file, given its relative name."
  (concat (file-name-as-directory org-directory) filename))

  ; (setq org-inbox-file "~/org/inbox.org")
  (setq org-index-file (org-file-path "life.org"))
  (setq org-archive-location
      (concat (org-file-path "archive.org") "::* From %s"))

  (setq org-default-notes-file "~/org/refile.org")

  (setq org-agenda-todo-ignore-scheduled t)

  (setq org-capture-templates
        '(("l" "Today I learned"
           entry
           (file+datetree (org-file-path "til.org"))
           "* %?\n")
          ("u" "link"
           entry
           (file+headline org-index-file "check links")
           "* %^L\n")
          ("w" "Week review"
           entry
           (file+datetree (org-file-path "weeklog.org"))
           "* %?\n")
          ("t" "todo item"
           entry
           (file+headline org-index-file "todo")
           "* TODO %?\n")))


#+END_SRC

#+RESULTS:
| l | Today I learned | entry | (file+datetree (org-file-path til.org))     | * %?      |
| u | link            | entry | (file+headline org-index-file check links)  | * %^L      |
| w | Week review     | entry | (file+datetree (org-file-path weeklog.org)) | * %?      |
| t | todo item       | entry | (file+headline org-index-file todo)         | * TODO %? |

** lsp
#+BEGIN_SRC emacs-lisp
        (use-package lsp-mode
          :init
          (setq lsp-keymap-prefix "C-c s")
        :hook (lsp-mode . lsp-enable-which-key-integration)
        :commands (lsp lsp-deferred))
      (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
    (use-package lsp-ui :commands lsp-ui-mode)
  (setq gc-cons-threshold 100000000)
(setq read-process-output-max (* 1024 1024 3)) ;; 3mb
#+END_SRC

#+RESULTS:
: 3145728

